
# 1. Написати код програми, яка запитує ім’я та прізвище. А потім виводить повідомлення «Привіт Прізвише Ім’я. Ми з України.» та визначає кількість символів і кількість літер «і» у повідомленні.

second_name = input("Прізвище:")
first_name = input("Ім'я:")
message = f"Привіт {second_name} {first_name}. Ми з України."
print(message)
print(f"Довжина повідомлення: {len(message)}, Кількість букв 'i': {message.lower().count('і')}")
# 2. Написати код програми, яка розмішує речення у декілька рядків:
# (двома способами)
# «Досить суттєвою перевагою Python є наявність стандартної
# бібліотеки, яка інсталюється разом з Python і містить готові інструменти
# для роботи з операційною системою, веб-сторінками, базами даних, різними
# форматами даних, для побудови графічного інтерфейсу програм тощо.»

print("""
Досить суттєвою перевагою Python є наявність стандартної
бібліотеки, яка інсталюється разом з Python і містить готові інструменти
для роботи з операційною системою, веб-сторінками, базами даних, різними
форматами даних, для побудови графічного інтерфейсу програм тощо.
""")
print(
    "Досить суттєвою перевагою Python є наявність стандартної\nбібліотеки, яка інсталюється разом з Python і містить готові інструменти\nдля роботи з операційною системою, веб-сторінками, базами даних, різними\nформатами даних, для побудови графічного інтерфейсу програм тощо.")

# 3. Написати код програми, яка виводить на екран словосполучення «Мене зовуть Прізвище Ім’я» 5 разів.
[print("Мене звати Юлія Резонтова") for i in range(5)]

# 4. Використовуючи функцію split, розбити рядок «Python це багатоцільова мова програмування». В результаті повинен вийти список слів.
input_string = "Python це багатоцільова мова програмування"
print(input_string.split(" "))

# 5. Із списку слів попередньої задачі скласти речення.
input_string = "Python це багатоцільова мова програмування"
print(" ".join(input_string.split(" ")))
